Autodesk.Revit.ApplicationServices.ControlledApplication.GetCloudModelInformationFromModelPath(System.String,System.String,System.String)
Gets cloud model guid from project id, folder id and model name.
projectId:
Project identity in BIM 360.
folderId:
Folder identity in BIM 360.
modelName:
Model name in BIM 360.
Returns:
Returns cloud model information.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL